Repository: darktable-org/darktable
Catalog: doc/usermanual/po/pl.tmx
Source language: en
Languages: pl

source: this option allows to force a specific means of getting the current display profile. this is useful when one alternative gives wrong results
pl: pozwala wymusić określony sposób pobierania bieżącego profilu monitora. przydatne, gdy jeden z wariantów daje nieprawidłowe rezultaty

source: tags
pl: etykiety

source: omit hierarchy in simple tag lists
pl: pomiń hierarchie w prostych listach tagów

source: when creating XMP file the hierarchical tags are also added as a simple list of non-hierarchical ones to make them visible to some other programs. when this option is checked darktable will only include their last part and ignore the rest. so 'foo|bar|baz' will only add 'baz'.
pl: przy tworzeniu pliku XMP tagi hierarchiczne są dodawane także jako prosta lista niehierarchicznych tagów, aby mogły być widoczne w innych programach. gdy ta opcja jest zaznaczona darktable będzie dodawać tylko ostatnią część ignorując resztę. więc „foo|bar|baz” doda tylko „baz”.

source: disable the entry completion
pl: wyłącz automatyczne uzupełnianie

source: the entry completion is useful for those who enter tags from keyboard only. for others the entry completion can be embarrassing. need to restart darktable.
pl: automatyczne uzupełnianie jest przydatne dla tych, którzy wpisują nazwy etykiet używając klawiatury. wymaga restartu.

source: other
pl: inne

source: do not show april 1st game
pl: nie pokazuj primaaprilisowej gry

source: password storage backend to use
pl: używany mechanizm przechowywania haseł

source: none
pl: brak

source: the storage backend for password storage: auto, none, libsecret, kwallet
pl: mechanizm przechowywania haseł: auto, brak, libsecret, kwallet

source: executable for playing audio files
pl: program do odtwarzania plików audio

source: this external program is used to play audio files some cameras record to keep notes for images
pl: ten zewnętrzny program będzie używany do odtwarzania plików audio, które niektóre aparaty nagrywają, aby przechowywać notatki do zdjęć

source: ignore JPEG images when importing film rolls
pl: ignoruj pliki JPEG podczas importu rolek filmu

source: when having raw+JPEG images together in one directory it makes no sense to import both. with this flag one can ignore all JPEGs found.
pl: jeśli w danym katalogu znajdują się te same zdjęcia w formatach raw i JPEG, to importowanie obu może być niepotrzebne. to ustawienie umożliwia pominięcie plików JPEG przy imporcie.

source: recursive directory traversal when importing filmrolls
pl: rekurencyjnie przeszukuj katalogi podczas importu rolek filmu

source: creator to be applied when importing
pl: twórca przypisywany podczas importu

source: publisher to be applied when importing
pl: wydawca przypisywany podczas importu

source: rights to be applied when importing
pl: prawa autorskie przypisywane podczas importu

source: comma separated tags to be applied when importing
pl: etykiety do przypisania podczas importu (oddzielone przecinkami)

source: initial import rating
pl: wstępna ocena przy imporcie

source: initial star rating for all images when importing a filmroll
pl: wstępna ocena nadawana wszystkim zdjęciom podczas importu rolek filmu

source: session options
pl: opcje sesji

source: base directory naming pattern
pl: wzorzec nazywania katalogu podstawowego

source: part of full import path for an import session
pl: część pełnej ścieżki importu w sesji importu

source: sub directory naming pattern
pl: wzorzec nazywania podkatalogu

source: keep original filename
pl: zachowaj oryginalną nazwę pliku

source: keep original filename instead of a pattern while importing from camera or card
pl: Przy imporcie z aparatu lub karty zachowaj oryginalną nazwę pliku zamiast używać wzorca.

source: file naming pattern
pl: wzorzec nazywania plików

source: file naming pattern used for a import session
pl: wzorzec nazywania plików używany w sesji importu

source: darktable manages your digital negatives in a database and lets you view them through a lighttable. It also enables you to develop raw images and enhance them in a darkroom.
pl: darktable zarządza twoimi cyfrowymi negatywami w bazie danych i pozwala ci je przeglądać na podświetlanym stole. Pozwala także wywoływać pliki raw i obrabiać je w ciemni.

source: Other modes besides lighttable and darkroom are a map for geotagging, tethering, print and a slideshow.
pl: Inne tryby poza stołem podświetlanym i ciemnią to mapa do geotaggingu, tethering, wydruk i pokaz slajdów.

source: darktable supports most modern cameras' raw formats, and does all of its processing at very high precision.
pl: darktable obsługuje większość formatów raw współczesnych aparatów i wykonuje obróbkę z bardzo wysoką precyzją.

source: Virtual light table, showing a collection
pl: Wirtualny stół podświetlany wyświetlający kolekcję

source: Virtual dark room with an opened image
pl: Wirtualna ciemnia z otwartym zdjęciem

source: Virtual dark room, sharpening an image
pl: Wirtualna ciemnia, wyostrzanie zdjęcia

source: Show images on a map
pl: Pokaż zdjęcia na mapie

source: Print your images
pl: Drukuj swoje zdjęcia

source: _cancel
pl: _anuluj

source: _save
pl: zapi_sz

source: average dE: %.02f max dE: %.02f
pl: średnie dE: %.02f maksymalne dE: %.02f

source: TODO: sorry, due to API restrictions we currently cannot set the BPP to
pl: TODO: przepraszamy, ze względu na ograniczenia API obecnie nie możemy ustawić rozdzielczości bitowej do

source: unknown option for --hq
pl: nieznana opcja dla --hq

source: unknown option for --export_masks
pl: nieznana opcja dla --export_masks

source: unknown option for --upscale
pl: nieznana opcja dla --upscale

source: unknown option for --apply-custom-presets
pl: nieznana opcja dla --apply-custom-presets

source: error: output file is a directory. please specify file name
pl: błąd: plik wyjściowy jest katalogiem. proszę podać nazwę pliku

source: output file already exists, it will get renamed
pl: plik wyjściowy już istnieje, nazwa zostanie zmieniona

source: error: can't open folder %s
pl: błąd: nie można otworzyć katalogu %s

source: error: can't open file %s
pl: błąd: nie można otworzyć pliku %s

source: no images to export, aborting
pl: nie wybrano zdjęć do eksportu, przerywam

source: error: can't open xmp file %s
pl: błąd: nie można otworzyć pliku xmp %s

source: empty history stack
pl: wyczyść historię

source: cannot find disk storage module. please check your installation, something seems to be broken.
pl: nie udało się odnaleźć modułu przechowywania. proszę sprawdzić instalację , coś nie działa właściwie.

source: failed to get parameters from storage module, aborting export ...
pl: nie udało się pobrać parametrów z modułu przechowywania, przerywanie eksportowania ...

source: unknown extension '.%s'
pl: nieznane rozszerzenie „.%s”

source: failed to get parameters from format module, aborting export ...
pl: nie udało się pobrać parametrów z modułu formatu, przerywanie eksportowania ...

source: too much time to update aspect ratio for the collection
pl: zbyt dużo czasu, by uaktualnić proporcje boków kolekcji

source: film roll
pl: rolka filmu

source: folders
pl: katalogi

source: camera
pl: aparat

source: tag
pl: etykieta

source: date taken
pl: data

source: date-time taken
pl: data/czas

source: import timestamp
pl: importuj datę/czas

source: change timestamp
pl: zmień datę/czas

source: export timestamp
pl: eksportuj datę/czas

source: print timestamp
pl: drukuj datę/czas

source: history
pl: historia

source: color label
pl: kolorowe etykiety

source: lens
pl: obiektyw

source: focal length
pl: ogniskowa

source: aperture
pl: przysłona

source: exposure
pl: ekspozycja

source: aspect ratio
pl: proporcja boków

source: filename
pl: nazwa pliku

source: grouping
pl: grupowanie

source: local copy
pl: kopia lokalna

source: module
pl: moduł

source: module order
pl: kolejność modułów

source: red
pl: czerwony

source: yellow
pl: żółty

source: green
pl: zielony

source: blue
pl: niebieski

source: purple
pl: fioletowy

source: basic
pl: podstawowe

source: auto applied
pl: zastosowane automatycznie

source: altered
pl: modyfikowane

source: tagged
pl: oznaczone

source: not copied locally
pl: nie skopiowany lokalnie

source: group leaders
pl: przewodnicy grupy

source: not defined
pl: niezdefiniowane

source: %d image of %d (#%d) in current collection is selected
pl: %d zdjęcie z %d (#%d) w obecnej kolekcji jest wybrane

source: %d image of %d in current collection is selected
pl: wybrane %d zdjęcie z %d w bieżącej kolekcji

source: work profile
pl: profil roboczy

source: export profile
pl: profil eksportu

source: softproof profile
pl: profil korekty ekranowej

source: system display profile
pl: systemowy profil monitora

source: sRGB (e.g. JPG)
pl: sRGB (np. JPG)

source: sRGB (web-safe)
pl: sRGB (dobry do Internetu)

source: Adobe RGB (compatible)
pl: Adobe RGB (kompatybilny)

source: linear Rec709 RGB
pl: liniowy Rec709 RGB

source: linear Rec2020 RGB
pl: liniowy Rec2020 RGB

source: linear prophoto RGB
pl: liniowy prophoto RGB

source: linear XYZ
pl: liniowy XYZ

source: linear infrared BGR
pl: liniowy podczerwony BGR

source: BRG (for testing)
pl: BRG (do testów)

source: embedded ICC profile
pl: osadzony profil ICC

source: embedded matrix
pl: osadzona macierz

source: standard color matrix
pl: standardowa macierz kolorów

source: enhanced color matrix
pl: poprawiona macierz kolorów

source: vendor color matrix
pl: macierz kolorów producenta

source: alternate color matrix
pl: alternatywna macierz kolorów

source: BRG (experimental)
pl: BRG (eksperymentalna)

source: HLG Rec2020
pl: v3.0

source: file `%s' to print not found for image %d on `%s'
pl: plik „%s” do wydruku nie znaleziony dla zdjęcia %d na „%s”

source: failed to create temporary file for printing options
pl: nie udało się utworzyć tymczasowego pliku do opcji drukowania

source: printing on `%s' cancelled
pl: drukowanie na „%s” anulowane

source: error while printing `%s' on `%s'
pl: błąd przy drukowaniu „%s” na „%s”

source: printing `%s' on `%s'
pl: drukowanie „%s” na „%s”

source: found strange path `%s'
pl: znaleziono dziwną ścieżkę „%s”

source: error loading directory `%s'
pl: błąd przy wczytywaniu katalogu „%s”

source: file `%s' has unknown format!
pl: format pliku „%s” jest nieznany!

source: error loading file `%s'
pl: błąd przy wczytywaniu pliku „%s”

source: darktable - run performance configuration?
pl: darktable - uruchomić konfigurację wydajności?

source: we have an updated performance configuration logic - executing that might improve the performance of darktable. this will potentially overwrite some of your existing settings - especially in case you have manually modified them to custom values. would you like to execute this update of the performance configuration?
pl: zaktualizowaliśmy logikę konfigurowania wydajności - zastosowanie jej może poprawić wydajność darktable. to może potencjalnie zmienić niektóre istniejące ustawienia - w szczególności w przypadku, gdy zostały ręcznie zmodyfikowane. czy chcesz zastosować zaktualizowaną konfigurację wydajności?

source: no
pl: nie

source: yes
pl: tak

source: At startup, the database failed to open because at least one of the two files in the database is locked. The persistence of the lock is mainly caused by one of the two following causes: - Another occurrence of darktable has already opened this database file and locked it for its benefit. - A previous occurrence of darktable ended abnormally and therefore could not close one or both files in the database properly. How to solve this problem? 1 - Search in your environment if another darktable occurrence is active. If so, use it or close it. The lock indicates that the process number of this occurrence is : <i><b>%d</b></i> 2 - If you can't find this other occurrence, try closing your session and reopening it or shutting down your computer. This will delete all running programs and thus close the database correctly. 3 - If these two actions are not enough, it is because at least one of the two files that materialize the locks remains and that these are no longer attached to any occurrence of darktable. It is then necessary to delete it (or them). The two files are named <i>data.db.lock</i> and <i>library.db.lock</i> respectively. The opening mechanism signals the presence of the <i><b>%s</b></i> file in the <i><b>%s</b></i> folder. (full pathname: <i><b>%s</b></i>). <u>Caution!</u> Do not delete these files without first checking that there are no more occurrences of darktable, otherwise you risk generating serious inconsistencies in your database. As soon as you have identified and removed the cause of the lock, darktable will start without any problem.
pl: Przy uruchamianiu programu nie udało się otworzyć bazy danych, ponieważ przynajmniej jeden z dwóch plików bazy danych jest zablokowany. Jest to najczęściej spowodowane jednym z dwóch problemów: - Inna instancja darktable otworzyła bazę danych dla swoich potrzeb. - Poprzednie uruchomienie darktable zakończyło się błędem i baza danych nie została zamknięta poprawnie. Jak rozwiązać ten problem? 1 - Sprawdź, czy inna instancja darktable nie jest już uruchomiona. Jeśli tak, użyj jej, bądź zamknij. Blokada wskazuje, że numer aktywnego procesu darktable to: <i><b>%d</b></i> 2 - Jeśli nie możesz znaleźć innej uruchomionej instancji darktable, spróbuj się wylogować lub zrestartować komputer. 2 - If you can't find this other occurrence, try closing your session and reopening it or shutting down your computer. To zamknie wszystkie działające programy i powinno poprawnie zamknąć bazę danych. 3 - Jeśli powyższe akcje nie wystarczą znaczy to, że przynajmniej jeden z dwóch plików, które blokują bazę danych pozostał i nie jest związany z żadnym działającym procesem darktable. Wtedy konieczne będzie skasowanie go (lub ich). Te dwa pliki to: <i>data.db.lock</i> i <i>library.db.lock</i>. Mechanizm dostępu do bazy danych wskazuje na obecność pliku <i><b>%s</b></i> w katalogu <i><b>%s</b></i>. (pełna ścieżka: <i><b>%s</b></i>). <u>Uwaga!</u> Nie kasuj tych plików bez uprzedniego upewnienia się, że nie działa już żaden proces darktable, ponieważ może to doprowadzić do poważnych niespójności w bazie danych Jak tylko przyczyna zostanie zidentyfikowana i usunięta, darktable powinien uruchomić się bez problemu.

source: darktable cannot be started because the database is locked
pl: darktable nie może zostać uruchomiony ponieważ baza danych jest zablokowana

source: close darktable
pl: zamknij darktable

source: the database lock file contains a pid that seems to be alive in your system: %d
pl: blokada bazy danych zawiera pid, który wydaje się być obecny w systemie: %d

source: the database lock file seems to be empty
pl: plik blokady bazy danych wydaje się być pusty

source: error opening the database lock file for reading: %s
pl: błąd otwierania do odczytu pliku blokady bazy danych: %s

source: the database schema has to be upgraded for <span style="italic">%s</span> do you want to proceed or quit now to do a backup
pl: schemat bazy danych musi zostać uaktualniony dla <span style="italic">%s</span> czy chcesz to zrobić teraz, czy wyjść, aby zrobić kopię zapasową?

source: darktable - schema migration
pl: darktable - migracja schematu

source: upgrade database
pl: uaktualnienie bazy danych

source: an error has occurred while trying to open the database from <span style="italic">%s</span> it seems that the database is corrupt. do you want to close darktable now to manually restore the database from a backup or start with a new one?
pl: wystąpił błąd przy próbie otwarcia bazy danych z <span style="italic">%s</span> wygląda, że baza danych jest uszkodzona. czy chcesz teraz zamknąć darktable, żeby ręcznie przywrócić bazę z kopii zapasowej, czy utworzyć nową?

source: darktable - error opening database
pl: darktable - błąd otwierania bazy danych

source: delete database
pl: skasuj bazę danych

source: click later to be asked on next startup
pl: kliknij „później”, aby zdecydować przy następnym uruchomieniu

source: click later to be asked when closing darktable
pl: kliknij „później”, aby zdecydować przy zamykaniu darktable

source: click later to be asked next time when closing darktable
pl: kliknij „później”, aby zdecydować przy następnym zamykaniu darktable

source: the database could use some maintenance there's <span style="italic">%s</span> to be freed do you want to proceed now? %s you can always change maintenance preferences in core options
pl: baza danych wymaga konserwacji zwolnionych zostanie <span style="italic">%s</span> czy wykonać konserwację teraz? %s opcje konserwacji możesz zawsze zmienić w preferencjach podstawowych

source: darktable - schema maintenance
pl: darktable - migracja schematu

source: later
pl: później

source: fast guided filter failed to allocate memory, check your RAM settings
pl: błąd alokacji pamięci dla filtra prowadzonego, sprawdź ustawienia RAM

source: do you want to remove this empty directory?
pl: na pewno chcesz usunąć ten pusty katalog?

source: remove empty directory?
pl: usunąć pusty katalog?

source: name
pl: nazwa

source: cannot remove film roll having local copies with non accessible originals
pl: nie można usunąć rolki filmu z lokalnymi kopiami, gdy nie są dostępne oryginały

source: you need to copy history from an image before you paste it onto another
pl: przed wklejeniem historii do zdjęcia trzeba ją skopiować z innego

source: on
pl: wł.

source: Sorry,<p>something went wrong. Please try again.</p>
pl: Przepraszam,<p>coś poszło nie tak. Spróbuj jeszcze raz.</p>

source: Thank you,<p>everything should have worked, you can <b>close</b> your browser now and <b>go back</b> to darktable.</p>
pl: Dziękuję,<p>wszystko powinno zadziałać, możesz teraz <b>zamknąć</b> przeglądarkę i <b>powrócić</b> do darktable.</p>

source: orphaned image
pl: osierocone zdjęcie

source: cannot access local copy `%s'
pl: nie można uzyskać dostępu do lokalnej kopii „%s”

source: cannot write local copy `%s'
pl: nie można zapisać lokalnej kopii „%s”

source: error moving local copy `%s' -> `%s'
pl: błąd przenoszenia lokalnej kopii „%s” -> „%s”

source: error moving `%s': file not found
pl: błąd przy przenoszeniu „%s”: plik nie został odnaleziony

source: error moving `%s' -> `%s': file exists
pl: błąd przy przenoszeniu „%s” -> „%s”: plik istnieje

source: error moving `%s' -> `%s'
pl: błąd przenoszenia „%s” -> „%s”

source: cannot create local copy when the original file is not accessible.
pl: nie można utworzyć lokalnej kopii, gdy oryginał nie jest dostępny.

source: cannot create local copy.
pl: nie można utworzyć lokalnej kopii.

source: cannot remove local copy when the original file is not accessible.
pl: nie można usunąć lokalnej kopii, gdy oryginał nie jest dostępny.

source: %d local copy has been synchronized
pl: %d kopia lokalna została zsynchronizowana

source: image `%s' is not available!
pl: zdjęcie „%s” jest niedostępny!

source: failed to allocate memory for %s, please lower the threads used for export or buy more memory.
pl: nie udało się przydzielić pamięci dla %s, proszę zmniejszyć liczbę wątków używanych do eksportu lub kupić więcej pamięci.

source: thumbnail export
pl: eksport miniaturek

source: export
pl: eksport

source: cannot find the style '%s' to apply during export.
pl: nie można znaleźć stylu „%s” do zastosowania przy eksporcie.

source: couldn't expand to a unique filename for session, please check your import session settings.
pl: nie można rozszerzyć do unikalnej nazwy pliku dla sesji, proszę sprawdzić ustawienia sesji importu.

source: custom
pl: dowolny

source: legacy
pl: przestarzały

source: unsupported working profile %s has been replaced by Rec2020 RGB!
pl: nieobsługiwany profil roboczy %s został zastąpiony przez Rec2020 RGB!

source: generic poissonian
pl: generyczny poissonowski

source: noiseprofile file `%s' is not valid
pl: plik „%s” z profilem szumu nie jest poprawny

source: due to a slow GPU hardware acceleration via opencl has been de-activated.
pl: z powodu wolnej karty graficznej akceleracja przez opencl została wyłączona.

source: multiple GPUs detected - opencl scheduling profile has been set accordingly.
pl: wykryto kilka kart graficznych - profil szeregowania opencl ustawiony odpowiednio.

source: very fast GPU detected - opencl scheduling profile has been set accordingly.
pl: wykryto bardzo szybką kartę graficzną - profil szeregowania opencl ustawiony odpowiednio.

source: opencl scheduling profile set to default.
pl: profil szeregowania opencl ustawiony na domyślny.

source: inch
pl: cal

source: GNOME Keyring backend is no longer supported. configure a different one
pl: GNOME Keyring nie jest już obsługiwany. skonfiguruj inny

source: rejecting %d image
pl: odrzucanie %d zdjęcia

source: applying rating %d to %d image
pl: dodawanie oceny %d dla %d zdjęcia

source: no images selected to apply rating
pl: nie wybrano zdjęć, aby dodać oceny

source: style with name '%s' already exists
pl: styl o nazwie „%s” już istnieje

source: styles/apply %s
pl: style/zastosuj %s

source: style named '%s' successfully created
pl: utworzenie stylu o nazwie „%s” zakończone powodzeniem

source: no image selected!
pl: nie wybrano zdjęć!

source: module `%s' version mismatch: %d != %d
pl: moduł „%s” niedopasowanie wersji: %d != %d

source: failed to overwrite style file for %s
pl: nie udało się nadpisać pliku stylu dla %s

source: style file for %s exists
pl: plik stylu dla %s już istnieje

source: style %s was successfully imported
pl: import stylu %s zakończony powodzeniem

source: above sea level
pl: powyżej poziomu morza

source: below sea level
pl: poniżej poziomu morza

source: creator
pl: twórca

source: publisher
pl: wydawca

source: title
pl: tytuł

source: description
pl: opis

source: rights
pl: uprawnienia

source: notes
pl: notatki

source: version name
pl: nazwa wersji

source: working...
pl: pracuje...

source: scroll to change <b>%s</b> of %s module
pl: użyj kółka myszy aby zmienić wartość <b>%s</b> w module %s

source: select
pl: wybór

source: path
pl: ścieżka

source: xmp timestamp
pl: znacznik czasu xmp

source: database timestamp
pl: znacznik czasu bazy danych

source: updated xmp sidecar files found
pl: znaleziono zaktualizowany plik pomocniczy xmp

source: _close
pl: _zamknij

source: select all
pl: wybierz wszystko

source: update database from selected xmp files
pl: zaktualizuj bazę danych z wybranego pliku xmp

source: overwrite selected xmp files
pl: nadpisz wybrane pliki xmp

source: capturing %d image
pl: robienie %d zdjęcia

source: please set your camera to manual mode first!
pl: prosimy najpierw przestawić aparat w tryb manualny!

source: capture images
pl: zrób zdjęcia

source: %d/%d imported to %s
pl: %d/%d zaimportowano do %s

source: starting to import images from camera
pl: rozpoczęcie importu zdjęć z aparatu

source: importing %d image from camera
pl: importowanie %d zdjęcia z aparatu

source: import images from camera
pl: import zdjęć z aparatu

source: failed to create film roll for destination directory, aborting move..
pl: nie udało się utworzyć rolki filmu dla katalogu docelowego, przerywanie przenoszenia..

source: exposure bracketing only works on raw images.
pl: bracketing ekspozycji działa tylko na zdjęciach raw.

source: images have to be of same size and orientation!
pl: zdjęcia muszą być takiego samego rozmiaru i orientacji!

source: merging %d image
pl: łączenie %d zdjęcia

source: wrote merged HDR `%s'
pl: zapisano połączony HDR „%s”

source: duplicating %d image
pl: duplikowanie %d zdjęcia

source: flipping %d image
pl: odbijanie %d zdjęcia

source: removing %d image
pl: usuwanie %d zdjęcia

source: could not send %s to trash%s%s
pl: nie można przenieść %s do kosza%s%s

source: could not physically delete %s%s%s
pl: nie można fizycznie skasować %s%s%s
